<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>LB-6</title>
  <link rel="stylesheet" type="text/css" href="style.css">
</head>
<header>

  

    <nav class="container">
      <ul id="menu">
        <li><a href="">Озёра Беларуси — ТОП-12 крупнейших</a></li>
      </ul>
    </nav>


     


</header>




<body>
	<div class="container">
  <div class="posts-list">

    


   


    <article id="post-1" class="post">
      <div class="post-image"><a href=""><img src="boloto.jpg"></a></div>
      <div class="post-content">
        
        <h2 class="post-title">Почему Беларусь зовут «синеокой»?</h2>
        
        <p> Тут не нужно иметь семь пядей во лбу, чтобы назвать правильный ответ. Нетронутая природа, кристально чистые озера, глядящие голубыми глазами в светлое небо, тысячи больших и малых рек, змейками струящиеся сквозь равнинные просторы, и заповедные болота, где нашли свои пристанище редкие виды животных и растений. Устраивайтесь поудобней, а мы начинаем свое путешествие по самым большим озёрам Беларуси. </p>
        
        
        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-2" class="post">
      <div class="post-image"><a href=""><img src="boloto2.jpg"></a></div>
      <div class="post-content">
        
        <h2 class="post-title">Нарочь, Минская область</h2>
        
        <p>Находится в самом центре заповедника с одноименным названием и является самым популярным местом для отдыха среди туристов и коренных белорусов. Озеро образовалось в результате таяния ледника несколько тысячелетий назад. Площадь составляет почти 80 км2, а вот глубина сравнительно небольшая – около 8,9 метров, хотя в районе Гатовских ям может достигать 25 метров. Озеро отличается удивительно прозрачной водой: летом можно разглядеть дно на глубине 5-7 метров, а зимой и того больше. Это визитная карточка Беларуси, слава о которой уже давно ушла за пределы страны. У озера богатое историческое прошлое: так, в годы Первой Мировой войны здесь проходила Нарочанская наступательная операция, которая положила начало освобождению белорусов от оккупантов. Вокруг озера раскинулся заповедник «Нарочанский»: место обитания редких животных и растений. Здесь же разместился крупнейший в Беларуси бальнеологический курорт: излюбленное место для отдыха иностранных туристов.  </p> 
        
        <div class="map">
              <script type="text/javascript" charset="utf-8" async src="https://api-maps.yandex.ru/services/constructor/1.0/js/?um=constructor%3A80da9fb4acc6f469af0044333e96ff4f89f5a52b07cfb3c65b6bacdd17577fc7&amp;width=100%25&amp;height=400&amp;lang=ru_RU&amp;scroll=true"></script>
        </div>  
          
        <div class="post-footer">
          
        </div>

      </div>
    </article>

    <article id="post-3" class="post">
      <div class="post-image"><a href=""><img src="boloto3.jpg"></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Освейское, Витебская область </h2>

        <p> Второе по величине озеро в Беларуси находится на севере Верхнедвинского района Витебской области. При достаточно большой площади водного зеркала (почти 53 км2), средняя глубина Освейского озера не такая уж и большая – почти 2 метра. На водной глади «плавает» величественный остров, которого местные жители прозвали «Призраком». И не потому, что остров время от времени меняет свои координаты: по словам очевидцев, здесь часто виднеется белесоватое пятно, которое распугивает рыбу. И действительно, рыбакам на крупном острове делать нечего: клева не будет. Но «Призрак» — далеко не единственный участок суши на озере. Из-за колебаний уровня воды на водном зеркале островов образовалось достаточно много: на данный момент их более 20 штук. Территория вокруг озера принадлежит одноименному заказнику, который был создан для сохранения уникальной экосистемы и ее обитателей. На данный момент здесь гнездится баклан, белые цапли, благородные лебеди и другие пернатые. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-4" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Дрисвяты, Витебская область </h2>

        <p> Озеро расположено на белорусско-литовской границе. Его площадь составляет почти 45 км2, длина – 13 км, а максимальная глубина – 33,3 метра. Благодаря низкому содержанию органических веществ в толще воды, ее прозрачность в некоторых местах достигает 4 метров. Озеро находится на реке с одноименным названием, его питают 13 водотоков. Извилистая береговая линия озера образует множество живописных заливов, большая часть которых сконцентрирована в южной части. На одном из островов озера в старину стоял величественный замок, от которого не осталось ничего, кроме земляного укрепления. В деревне Дрисвяты сохранился уникальный памятник архитектуры – церковь Св. Петра и Павла (1908 г.). Долгое время озеро использовалось как водоем-охладитель для Игналинской АЭС, из-за чего флора и фауна претерпела сильные изменения. Однако сейчас деятельность станции приостановлена, благодаря чему озерная экосистема начала интенсивно восстанавливаться. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-5" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Червоное, Гомельская область </h2>

        <p> Червоное или Князь-Озеро является уникальным природным экспонатом. Площадь водного зеркала составляет около 40 км2. Крупнейшее озеро Полесья раскинулось среди живописных равнин и реликтовых болот. С названием связано множество легенд: по одной из них, озеро получило такое имя из-за рыбы красноперки, которая здесь обитает в большом количестве; другая же легенда гласит, что в древности здесь, на Гомельщине, произошла величайшая битва между богатырями: из-за пролитой крови озеро окрасилось в алый цвет, поэтому и получило название Червоное. Дно устлано сапропелями: это не только полезные удобрения, но  и лечебные грязи, которые по своим целебным качествам не уступают крымским.  Несмотря на большую площадь поверхности, озеро совсем не глубокое – максимально зарегистрированный показатель равен 3,5 метра. У озера есть свои острова, общая площадь которых составляет 6 га. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-6" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Лукомльское, Витебская область </h2>

        <p> Площадь озера составляет 37,7 км2, глубина водоема в некоторых местах достигает 11,5 метра. Невероятно красивое озеро Витебщины имеет сложно устроенную котловину. Подводная часть озера чередуется мелями и впадинами. Помимо их, есть еще и 4 острова. Вода в озере пресная, теплая и чистая. Последнее качество – заслуга дрейсены (небольшие двустворчатые моллюски, которые обитают здесь в большом количестве и очищают воду буквально за 2 месяца). А температура воды выше нормы потому, что озеро является охладителем для Лукомльской ГРЭС. В толще  воды обитает огромное количество рыб , поэтому здесь хорошо развито любительское рыболовство, а на незамерзающей части озера зимуют утки. Живописная местность и уникальные характеристики водоема создали все условия для развития инфраструктуры: так, на западной стороне озера работает детский лагерь и профилакторий. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-7" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Дривяты, Витебская область </h2>

        <p> На севере Беларуси есть «голубое ожерелье», жемчужиной которого является озеро Дривяты, входящее в группу Браславских озер. История этого водоема начинается еще с ледникового периода. Шестое по величине и, пожалуй, первое по красоте озеро Беларуси объединяет множество водоемов Браславского края в единый водный организм. Площадь зеркальной глади составляет чуть больше 36 км2, есть 6 небольших островов. Подводная часть мелководна: поговаривают, что заядлые рыбаки могут запросто назвать около 50 мелей. Именно поэтому летом вода в Дривятах прогревается очень быстро. Озеро открыто для ветров любых направлений. В пасмурную погоду вода приобретает свинцовый оттенок, как настоящее море. Издавна Дривяты славились рыбным разнообразием, и сейчас в водах озера можно поймать знаменитого угря, которому местные дали звучное прозвище «король голубых нив». А браславского судака знали еще во времена Российской империи: уж больно вкусной была рыбка, выловленная в уникальной экосистеме.</p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-8" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Выгонощанское, Брестская область
        </h2>

        <p> Одно из крупнейших озер Брестской области окружено непроходимыми болотами, в которых в годы Великой Отечественной войны скрывались белорусские партизаны. Площадь полесской жемчужины составляет 26 км2, при желании его можно пройти пешком, ведь максимальная глубина водоема – всего 2,7 метра. В далеких 1787 – 1783 годах через озеро был проложен судоходный путь, соединяющий Балтийское и Черное моря. В настоящее время Огинский канал – памятник истории. Выгонощанское озеро – идеальное место для уединенного отдыха, ведь водоем окружают непроходимые болотные тропы, а рядом есть живописная и очень колоритная деревенька со своей историей. Озеро находится в самом сердце одноименного заказника, на территории которого гнездятся редкие виды птиц. Туристы из далекой Великобритании, Германии, Швеции и других стран ежегодно приезжают для того, чтобы посмотреть на гнездовья бородатой Неясыти, орлана-белохвоста и других пернатых. Выгонощанское озеро – один из самых крупных бассейнов Европы, который сохранился почти в первозданном виде. Оно является Ключевой Орнитологической территорией, а по Рамсарской конвенции имеет статус водно-болотного угодья европейского значения. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-9" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Нещердо, Витебская область </h2>

        <p> Озеро относится к бассейну Западной Двины, его площадь составляет 27,4 км2, а протяженность береговой линии – более 50 км, что дает право назвать Нещердо рекордсменом в этой категории. Извилистые и сильно изрезанные берега с большим количеством мысов и заливов придают озеру экзотическую живописность. Внешне водоем больше напоминает величественное, умиротворенное и абсолютно спокойное озеро-море. На поверхности есть два небольших острова, его питают мелкие реки и ручейки. Недавно территорию, окружающую реликтовое озеро, объявили заказником местного значения. Природоохранный комплекс был создан с целью сохранения уникальной экосистемы и биологического разнообразия. Местный писатель, Ян Борщевский окружил озеро ореолом таинственности: по его рассказам, в озере живут огромные цмоки (белорусские драконы). И правда, местные говорят, что всякое может привидеться. Нещердо популярно среди туристов благодаря своей красоте и возможностями для уединенного отдыха. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-10" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Свирь, Минская область </h2>

        <p> Находится в северо-западной части Беларуси и является частью национального парка «Нарочанский». Площадь водной глади составляет 28,3 км2, а протяженность береговой линии – 31,2 км. Средняя глубина достигает почти 4 метров. Дно озера выстлано сапропелем, а его высокие берега являются местом обитания диких водоплавающих птиц. Из озера берет свое начало река с одноименным названием, которая несет свои воды в Неман и Балтийское море. Ученые полагают, что название озера произошло от финского слова syveri — «углубление», «глубокое место в воде». В водах озера водится большое количество рыбы, а прилегающая территория просто создана для уединенного отдыха на лоне природы, чем и пользуются многочисленные туристы из Беларуси и других стран. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-11" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Снуды, Витебская область </h2>

        <p> Озеро могло бы запросто претендовать на звание самого красивого водоема Беларуси из-за невероятно красивого бирюзового оттенка воды в нем. Снуды входят в Браславскую группу озер, а его площадь составляет 22 км2. Озеро пользуется мистической репутацией: по одной из легенд, на его берегу уснула группа крестоносцев, которых потом перебили местные жители. Если рассуждать с научной точки зрения, то у озера богатая история: здесь стоит упомянуть группу валунов, расположенных посреди озера на острове Красногорка. Согласно исторической справке, это место использовалось для жертвоприношений и ритуалов: правда, кто и когда это делал – ученым неизвестно. От озера берет свое начало экологическая тропа, которая проходит по можжевеловым редколесьям через смешанный лес. Тем, кто хоть раз бывал в Швеции, панорама озера Снуды покажется очень знакомой: уж больно красивы извилистые берега этого водоема. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-12" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Черное озеро, Брестская область </h2>

        <p> Площадь одного из самых красивых озер Брестчины составляет 17,3 км2. Глубина небольшая: средний показатель равен 6,5 метров. Береговая линия растянулась на 20 км. Несмотря на мрачное название, вода в этом озере достаточно чистая, благодаря чему здесь водится большое количество рыб, ракообразных и мелких моллюсков. Это достаточно известная рекреационная зона страны: коренные белорусы и иностранные гости ежегодно съезжаются к берегам Черного озера, чтобы насладиться кристально чистым воздухом, хвойным ароматом и умиротворенным отдыхом. В водах водится белый амур, щука, карась, лещ, красноперка и раки. Вблизи озера есть небольшие коттеджи и домики семейного типа, где можно отдохнуть большой компанией. Берега низкие, по большей части заболоченные. К озеру прилегает смешанный лес, богатый на дикие ягоды и грибы. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

    <article id="post-13" class="post">
      <div class="post-image"><a href=""><img src=""></a></div>
      <div class="post-content">
        
        <h2 class="post-title"> Мядель, Минская область </h2>

        <p> Живописное озеро удачно расположилось почти в самом центре Минской области. Его площадь составляет 16,2 км2, а средняя глубина – 6,5 метра (максимальная – 25 м). Берега извилистые, с большим количеством мысов.Озеро У озера есть 8 небольших островков, наибольший интерес из которых представляет Замок. На нем действительно сохранились остатки бывшего укрепления, которое, по мнению археологов, датируется XI-XIII вв. Вдоль берегов есть много беседок и обустроенных мест для отдыха и купания. Также есть гостевой домик для больших компаний и хорошо развитая инфраструктура. Озеро принадлежит Национальному парку «Нарочанский», пользуется большой популярностью среди рыбаков. Кстати, использовать лодки с мотором на территории озера запрещено. Рядом с озером – деревня с одноименным названием, в которой стоит посетить бывший монастырь кармелитов, где сохранился костел, считающийся одним из лучших образцов барокко на севере Беларуси. </p> 

        <div class="post-footer">
        </div>

      </div>
    </article>

<article><form action="./mail.php" method="post">
  <!--Тег используется для группировки связанных элементов в форме-->
  <fieldset>
  <!--Тег задает заголовок для групповых элементов-->
  <legend>Оставьте сообщение:</legend>
  Ваше имя:
  <!--Устанавливает однострочное текстовое поле ввода:-->
  <input type="text" name="name">
  <!--Используется для полей ввода, которые должны содержать адрес электронной почты.-->
  E-mail:
  <input type="text" name="email">
  Номер телефона:
  <input type="text" name="phone">
  Сообщение:
  <!--Тег разрешает многострочный ввод текста.-->
  Текстовая область может содержать неограниченное количество символов-->
  <textarea rows="10" cols="45" name="message"></textarea>
  <!--Устанавливает кнопку для отправки данных формы в обработчик формы.-->
  <input type="submit" value="Отправить сообщение">
  </fieldset>
  </form></article>

  </div> <!-- конец div class="posts-list"-->
  <aside>
  
  <div class="widget" style="background:white;
  -webkit-border-radius:15px;
  -moz-border-radius:15px;
  text-align: center;
  border-radius:15px">
    <h3 class="widget-title" style="background:snow;
    -webkit-border-radius:15px;
    -moz-border-radius:15px;
    text-align: center;
    border-radius:15px">Последние записи</h3>
    <ul class="widget-posts-list">

      <li>
        <div class="post-image-small">
        </div>
        <h4 class="widget-post-title"><a href="#post-2"><img src="">Нарочь, Минская область</a></h4>
      </li>

      <li>
        <div class="post-image-small">
          <a href=""><img src=""></a>
        </div>
        <h4 class="widget-post-title"><a href="#post-3"><img src="">Освейское, Витебская область</h4>
      </li>

      <li>
        <div class="post-image-small">
          <a href=""><img src=""></a>
        </div>
        <h4 class="widget-post-title"><a href="#post-4"><img src="">Дрисвяты, Витебская область</h4>
      </li>

      <li>  
        <div class="post-image-small">
          <a href=""><img src=""></a>
        </div>
        <h4 class="widget-post-title"><a href="#post-5"><img src="">Червоное, Гомельская область</h4>
      </li>

      <li>
        <div class="post-image-small">
          <a href=""><img src=""></a>
        </div>
        <h4 class="widget-post-title"><a href="#post-6"><img src="">Лукомльское, Витебская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-7"><img src="">Дривяты, Витебская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-8"><img src="">Выгонощанское, Брестская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-9"><img src="">Нещердо, Витебская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-10"><img src="">Свирь, Минская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-11"><img src="">Снуды, Витебская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-12"><img src="">Черное озеро, Брестская область</h4>
      </li>

      <li>
      <div class="post-image-small">
        <a href=""><img src=""></a>
      </div>
      <h4 class="widget-post-title"><a href="#post-13"><img src="">Мядель, Минская область</h4>
      </li>

      <li>
         <div class="sidebar" style="text-align: right">
                     <form>
                                       
                    <div class="email" position="fixed">
                    <label for="email"><b>Email</b></label>
                        <input type="text" placeholder="Введите email" name="email" required >
                        </div>
                    <div class="email" position="fixed">
                    <label for="pass"><b>Password</b></label>
                        <input type="password" placeholder="Введите пароль" name="pass" required>
                      </div>
                    
                        <button type="submit" class="regbtn">Регистрация</button>
                    <p></p>
                    <div class="signin" style="text-align: right">
                    <?php

                        $client_id = 8096141; // ID приложения
                        $client_secret = 'S6gT4jVDPINzB4eWfl3M'; // Защищённый ключ
                        $redirect_uri = 'http://zoo:81'; // Адрес сайта
                        
                        $url = 'http://oauth.vk.com/authorize'; // Ссылка для авторизации на стороне ВК

                        $params = [ 'client_id' => $client_id, 
                        'redirect_uri'  => $redirect_uri,
                         'response_type' => 'code']; // Массив данных, который нужно передать для ВК содержит ИД приложения код, ссылку для редиректа и запрос code для дальнейшей авторизации токеном
                  
                         if (isset($_GET['code'])) {
                            $result = true;
                            $params = [
                                'client_id' => $client_id,
                                'client_secret' => $client_secret,
                                'code' => $_GET['code'],
                                'redirect_uri' => $redirect_uri
                            ];
                        
                            $token = json_decode(file_get_contents('https://oauth.vk.com/access_token' . '?' . urldecode(http_build_query($params))), true);
                        
                            if (isset($token['access_token'])) {
                                $params = [
                                    'uids' => $token['user_id'],
                                    'fields' => 'uid,first_name,last_name,screen_name,sex,bdate,photo_big',
                                    'access_token' => $token['access_token'],
                                    'v' => '5.101'];
                        
                                $userInfo = json_decode(file_get_contents('https://api.vk.com/method/users.get' . '?' . urldecode(http_build_query($params))), true);
                                if (isset($userInfo['response'][0]['id'])) {
                                    $userInfo = $userInfo['response'][0];
                                    $result = true;
                                }
                            }
                        
                            if ($result) {
                                echo "ID пользователя: " . $userInfo['id'] . '<br />';
                                echo "Имя пользователя: " . $userInfo['first_name'] . '<br />';
                                echo "Ссылка на профиль: " . $userInfo['screen_name'] . '<br />';
                                echo "Пол: " . $userInfo['sex'] . '<br />';
                                echo "День Рождения: " . $userInfo['bdate'] . '<br />';
                                echo '<img src="' . $userInfo['photo_big'] . '" />'; echo "<br />";
                        
                            }
                        }

                        $_SESSION['id'] = $userInfo['id'];
                  ?>
                    <?php 
                   if(isset($_SESSION['id'])) {

                    echo "Вы уже авторизованы";
            
                    } else {
                    echo $link = '<p><a href="' . $url . '?' . urldecode(http_build_query($params)) . '">Аутентификация через ВКонтакте</a></p>';
                    }
                     ?>
                    </div>
                    </form>
    <li class="btn-up">
        <a href="#top">Наверх</a>
      </li

                    
                </div>
            </div>
      </li>

  
      
    </ul>
  </div>
  
</aside>
</div> <!-- конец div class="container"-->

<footer>
  <div class="container">
    <div class="footer-col"><span>Беларусь © 2021</span></div>
    <div class="footer-col">
      
    </div>
  </div>
</footer>

<script>
$('.nav-toggle').on('click', function(){
$('#menu').toggleClass('active');
});
</script>
</body>
</html>

